Catalogs/ТЦОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>ТЦОбработки</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТЦТипОбработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Файл</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТЦТипОбработки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Enum>
		<Properties>
			<Name>ТЦТипОбработки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Внешняя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внутренняя</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ТЦОбработки/Forms/Обработка/Ext/Form/Module.bsl
&НаКлиенте
Перем кВнешняя;

&НаКлиенте
Перем кВнутреняя;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИмяВнешняя = "Перечисление.ТЦТипОбработки.Внешняя";
	кВнешняя = ПредопределенноеЗначение(ИмяВнешняя);
	ИмяВнутренняя = "Перечисление.ТЦТипОбработки.Внутренняя";
	кВнутреняя = ПредопределенноеЗначение(ИмяВнутренняя);
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
// Обработчик изменения типа тестовой обработки
//
Процедура ТипПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаСервере
// Обработчик создания формы на сервере
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		// Загрузка макета для новой обработки
		ТекущийОбъект = РеквизитФормыВЗначение("Объект");
		
		Если ТекущийОбъект.ЭтоНовый() Тогда
			АдресФайла = ПоместитьВоВременноеХранилище(ТекущийОбъект.ПолучитьМакет("Шаблон"), Новый УникальныйИдентификатор);
			ИмяФайла = "ТестоваяОбработка.epf";
		Иначе
			АдресФайла = ПоместитьВоВременноеХранилище(ТекущийОбъект.Файл.Получить(), Новый УникальныйИдентификатор);
		КонецЕсли;
		
		// Установка списка выбора имени внутренней обработки
		ТестовыеОбработки = ТЦСервер.СписокТестовыхОбработок();
		СписокВыбора = Элементы.ИмяОбработки.СписокВыбора;
		
		Для каждого ТестоваяОбработка Из ТестовыеОбработки Цикл
			СписокВыбора.Добавить(ТестоваяОбработка.Имя, ТестоваяОбработка.Синоним);
		КонецЦикла;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// 
//
// Параметры:
//  
//
// Возвращаемое значение:
//  
//
Функция СоздатьФайловыйДиалог(ТипДиалога)
	
	Диалог = Новый ДиалогВыбораФайла(ТипДиалога);
	Диалог.ПолноеИмяФайла = Объект.ИмяОбработки;
	Диалог.Фильтр = "Тестовая обработка(*.epf)|*.epf";
	Диалог.ПроверятьСуществованиеФайла = Истина;
	
	Возврат Диалог;
	
КонецФункции // СоздатьФайловыйДиалог()

&НаКлиенте
Процедура ИмпортОбработки(Команда)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТЦТипОбработки.Внешняя") Тогда
			Диалог = СоздатьФайловыйДиалог(РежимДиалогаВыбораФайла.Открытие);
			
			Если Диалог.Выбрать() Тогда
				ПоместитьФайл(АдресФайла, Диалог.ПолноеИмяФайла,, Ложь);
				ИмяФайла = ТЦОбщий.ИмяФайла(Диалог.ПолноеИмяФайла);
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭкспортОбработки(Команда)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТЦТипОбработки.Внешняя") Тогда
			Диалог = СоздатьФайловыйДиалог(РежимДиалогаВыбораФайла.Сохранение);
			Диалог.ПолноеИмяФайла = Объект.ИмяОбработки;
			
			Если Диалог.Выбрать() Тогда
				ПолучитьФайл(АдресФайла, Диалог.ПолноеИмяФайла, Ложь);
			КонецЕсли;
		КонецЕсли;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		ТЦКлиент.СообщитьОбОшибке(Ошибка, ДатаНачала, ТекущаяДата());
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
// 
//
// Параметры:
//  
//
Процедура УстановитьДоступностьЭлементовУправления()
	
	ЭтоВнешняя = Объект.Тип = кВнешняя;
	ЭтоВнутреняя = Объект.Тип = кВнутреняя;
	Элементы.Импорт.Доступность = ЭтоВнешняя;
	Элементы.Экспорт.Доступность = ЭтоВнешняя;
	Элементы.ИмяОбработки.Доступность = ЭтоВнутреняя;
	
КонецПроцедуры // УстановитьДоступностьЭлементовУправления()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Попытка
		ДатаНачала = ТекущаяДата();
		Если Не ПустаяСтрока(АдресФайла) Тогда
			ТекущийОбъект.Файл = Новый ХранилищеЗначения(
				ПолучитьИзВременногоХранилища(АдресФайла),
				Новый СжатиеДанных(9));
			ТекущийОбъект.ИмяФайла = ИмяФайла;
			АдресФайла = "";
		КонецЕсли;
	Исключение
		Ошибка = ИнформацияОбОшибке();
		ТЦОбщий.ЗаписатьВЖурнал(Ошибка);
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры
